; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_8 ?v5 ?v9)
             (pred_1 ?v3 ?v1)
             (pred_3 ?v5 ?v1)
             (pred_12 ?v10 ?v5 )
	     (pred_10 ?v5)
             (pred_11 ?v13)
             (pred_4 ?v3)
             (pred_6 ?v1)
             (pred_5 ?v5)
             (pred_2 ?v3)
             (pred_9 ?v5)
             (pred_7 ))



(:action op_5
:parameters (?v2 ?v11 ?v4 ?v7)
:precondition (and (pred_11 ?v2) (pred_11 ?v11) (pred_4 ?v4) (pred_6 ?v7)
          (pred_8 ?v2 ?v11) (pred_1 ?v4 ?v7)
                   (pred_3 ?v11 ?v7) (pred_10 ?v2) 
                   (pred_5 ?v11) (pred_2 ?v4))
:effect (and  (pred_9 ?v11) (not (pred_5 ?v11))))


(:action op_1
:parameters (?v2 ?v12)
:precondition (and (pred_11 ?v2) (pred_11 ?v12)
               (pred_10 ?v2) (pred_8 ?v2 ?v12) (pred_9 ?v12))
:effect (and (pred_10 ?v12) (not (pred_10 ?v2))))

(:action op_4
:parameters (?v2 ?v4)
:precondition (and (pred_11 ?v2) (pred_4 ?v4) 
                  (pred_10 ?v2) (pred_12 ?v4 ?v2) (pred_7 ))
:effect (and (pred_2 ?v4)
   (not (pred_12 ?v4 ?v2)) (not (pred_7 ))))


(:action op_3
:parameters (?v2 ?v8 ?v6)
:precondition (and (pred_11 ?v2) (pred_4 ?v8) (pred_4 ?v6)
                  (pred_10 ?v2) (pred_2 ?v6) (pred_12 ?v8 ?v2))
:effect (and (pred_2 ?v8) (pred_12 ?v6 ?v2)
        (not (pred_2 ?v6)) (not (pred_12 ?v8 ?v2))))

(:action op_2
:parameters (?v2 ?v4)
:precondition (and (pred_11 ?v2) (pred_4 ?v4) 
                  (pred_10 ?v2) (pred_2 ?v4))
:effect (and (pred_7 ) (pred_12 ?v4 ?v2) (not (pred_2 ?v4)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_11 obj_13 obj_12 obj_03 obj_18 obj_02 obj_19 obj_15 obj_04 obj_20 obj_08 obj_17 obj_10 obj_01 obj_07 obj_09
    obj_14 obj_16
    obj_06 obj_05
    )

    (:init
       (pred_7)

       (pred_11 obj_11)
       (pred_11 obj_13)
       (pred_11 obj_12)
       (pred_11 obj_03)
       (pred_11 obj_18)
       (pred_11 obj_02)
       (pred_11 obj_19)
       (pred_11 obj_15)
       (pred_11 obj_04)
       (pred_11 obj_20)
       (pred_11 obj_08)
       (pred_11 obj_17)
       (pred_11 obj_10)
       (pred_11 obj_01)
       (pred_11 obj_07)
       (pred_11 obj_09)
       (pred_6 obj_14)
       (pred_6 obj_16)
       (pred_4 obj_06)
       (pred_4 obj_05)

       (pred_8 obj_11 obj_18)
       (pred_8 obj_11 obj_13)
       (pred_8 obj_13 obj_02)
       (pred_8 obj_13 obj_12)
       (pred_8 obj_13 obj_11)
       (pred_8 obj_12 obj_19)
       (pred_8 obj_12 obj_03)
       (pred_8 obj_12 obj_13)
       (pred_8 obj_03 obj_15)
       (pred_8 obj_03 obj_12)
       (pred_8 obj_18 obj_04)
       (pred_8 obj_18 obj_02)
       (pred_8 obj_18 obj_11)
       (pred_8 obj_02 obj_20)
       (pred_8 obj_02 obj_19)
       (pred_8 obj_02 obj_13)
       (pred_8 obj_02 obj_18)
       (pred_8 obj_19 obj_08)
       (pred_8 obj_19 obj_15)
       (pred_8 obj_19 obj_12)
       (pred_8 obj_19 obj_02)
       (pred_8 obj_15 obj_17)
       (pred_8 obj_15 obj_03)
       (pred_8 obj_15 obj_19)
       (pred_8 obj_04 obj_10)
       (pred_8 obj_04 obj_20)
       (pred_8 obj_04 obj_18)
       (pred_8 obj_20 obj_01)
       (pred_8 obj_20 obj_08)
       (pred_8 obj_20 obj_02)
       (pred_8 obj_20 obj_04)
       (pred_8 obj_08 obj_07)
       (pred_8 obj_08 obj_17)
       (pred_8 obj_08 obj_19)
       (pred_8 obj_08 obj_20)
       (pred_8 obj_17 obj_09)
       (pred_8 obj_17 obj_15)
       (pred_8 obj_17 obj_08)
       (pred_8 obj_10 obj_01)
       (pred_8 obj_10 obj_04)
       (pred_8 obj_01 obj_07)
       (pred_8 obj_01 obj_20)
       (pred_8 obj_01 obj_10)
       (pred_8 obj_07 obj_09)
       (pred_8 obj_07 obj_08)
       (pred_8 obj_07 obj_01)
       (pred_8 obj_09 obj_17)
       (pred_8 obj_09 obj_07)
       (pred_5 obj_13)
       (pred_5 obj_09)
       (pred_3  obj_13 obj_14)
       (pred_3  obj_09 obj_16)
       (pred_9 obj_11)
       (pred_9 obj_12)
       (pred_9 obj_03)
       (pred_9 obj_18)
       (pred_9 obj_02)
       (pred_9 obj_19)
       (pred_9 obj_15)
       (pred_9 obj_04)
       (pred_9 obj_20)
       (pred_9 obj_08)
       (pred_9 obj_17)
       (pred_9 obj_10)
       (pred_9 obj_01)
       (pred_9 obj_07)

       (pred_1  obj_06 obj_14)
       (pred_1  obj_05 obj_16)
       (pred_12 obj_06 obj_18)
       (pred_12 obj_05 obj_04)
       (pred_10 obj_02)
    )

    (:goal (and
       (pred_12 obj_05 obj_15)
    ))
(:constraints
  (always (not (pred_10 obj_19)))
)
)

; plan
1. (op_1 obj_02 obj_18)
   deleted: (pred_10 obj_02)
   added: (pred_10 obj_18)
   goals met: 0 of 1
2. (op_1 obj_18 obj_04)
   deleted: (pred_10 obj_18)
   added: (pred_10 obj_04)
   goals met: 0 of 1
3. (op_4 obj_04 obj_05)
   deleted: (pred_12 obj_05 obj_04) (pred_7)
   added: (pred_2 obj_05)
   goals met: 0 of 1
4. (op_1 obj_04 obj_20)
   deleted: (pred_10 obj_04)
   added: (pred_10 obj_20)
   goals met: 0 of 1
5. (op_1 obj_20 obj_08)
   deleted: (pred_10 obj_20)
   added: (pred_10 obj_08)
   goals met: 0 of 1
6. (op_1 obj_08 obj_17)
   deleted: (pred_10 obj_08)
   added: (pred_10 obj_17)
   goals met: 0 of 1
7. (op_1 obj_17 obj_15)
   deleted: (pred_10 obj_17)
   added: (pred_10 obj_15)
   goals met: 0 of 1
8. (op_2 obj_15 obj_05)
   deleted: (pred_2 obj_05)
   added: (pred_7) (pred_12 obj_05 obj_15)
   goals met: 1 of 1
